app/views/profiles/show.html.erb

    <p>
      <% @user.languages.each do |language| %>
---
SELECT "languages".* FROM "languages" INNER JOIN "user_languages" ON "languages"."id" = "user_languages"."language_id" WHERE "user_languages"."user_id" = $1  [["user_id", 509723801]]