app/views/users/show.html.erb

SELECT  "genders".* FROM "genders" WHERE "genders"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "sexual_orientations".* FROM "sexual_orientations" WHERE "sexual_orientations"."id" = $1 LIMIT 1  [["id", 1]]
---
  <p>
    <%= Gender.find_by(id: @user.gender_id ).name %> looking for <%= SexualOrientation.find_by(id: @user.sexual_orientation_id ).name%>