app/controllers/profiles_controller.rb

SELECT "profiles".* FROM "profiles" WHERE ("profiles"."id" != $1)  ORDER BY "profiles"."updated_at" DESC  [["id", 1]]
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT 1  [["user_id", 280023622]]
---
  def index
    if current_user
      filtered = Profile.order(updated_at: :desc).where.not(id: current_user.profile.id).select {|profile| fits_filter(profile)}
      @profiles = filtered.shuffle.paginate(:per_page => 10)

SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT 1  [["id", 3]]
---
  def show
    @profile = Profile.find_by(id: params[:id])