app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.gender = Gender.find_by(id: params[:gender_id])
    @user.sexual_orientation = SexualOrientation.find_by(id: params[:sexual_orientation_id])
    @user.sexual_preference = SexualPreference.find_by(id: params[:sexual_preference_id])

    if @user.save
      session[:user_id] = @user.id
      Profile.create(user: @user)
      Filter.all.each do |filter|
---
SELECT  "genders".* FROM "genders" WHERE "genders"."id" = $1 LIMIT 1  [["id", 361619626]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "sexual_orientations".* FROM "sexual_orientations" WHERE "sexual_orientations"."id" = $1 LIMIT 1  [["id", 211320500]]
SELECT  "sexual_preferences".* FROM "sexual_preferences" WHERE "sexual_preferences"."id" = $1 LIMIT 1  [["id", 175409773]]
INSERT INTO "users" ("first_name", "last_name", "email", "username", "password_digest", "zip_code", "birthday", "gender_id", "sexual_orientation_id", "sexual_preference_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
INSERT INTO "profiles" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 509723801], ["created_at", "2016-02-24 15:59:11.959405"], ["updated_at", "2016-02-24 15:59:11.959405"]]
SELECT "filters".* FROM "filters"

  def show
    if current_user
      @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 0]]